package cn.itheima.data_simulator.util;

import org.apache.commons.lang3.RandomUtils;

import java.io.UnsupportedEncodingException;
import java.text.ParseException;
import java.text.SimpleDateFormat;
import java.util.Date;
import java.util.HashMap;
import java.util.Map;
import java.util.Random;

/**
 * 随机生成器
 */
public class RandomFieldsUtil {

//    private String nameStr = "安娜,艾丽华,安明喆,阿荣其木,安瑞生,艾维权,安维蓉,安永来,白林,白明,卜巍,卜伟,白昕,白雁,白夜,毕颖,白宝强,卜长堃,别春香,班凤英,毕红军,白海龙,白江涛,白丽华,包兰宇,白明洲,毕守锋,步世华,包铁军,白天林,白雪清,白秀清,白晓旭,边彦东,白永红,薄燕军,白延雷,白云龙,柏玉明,白延年,白彦清,白玉珍,鲍志斌,白震冬,白哲生,白之贞,陈博,陈斌,陈尘,常丹,陈峰,程菲,曹孚,常枫,程飞,陈凡,陈芳,陈庚,常工,楚浩,陈慧,陈剑,陈娟,陈岚,陈路,常玲,曹镭,崔玲,陈伶,陈力,陈林,陈梅,陈鹏,陈萍,蔡青,陈琪,陈茜,陈琦,曹睿,陈蕊,程实,常伟,崔伟,陈新,陈兴,程旭,陈莹,崇毅,唱宇,陈英,陈岩,陈颖,柴岳,崔铸,程哲,陈洲,陈安岳,蔡伯根,陈保利,陈宝生,陈宝玉,曹宝忠,陈常嘉,程朝卿,陈长盛,陈朝昀,陈东军,崔端平,慈德勋,崔德有,陈大中,成德忠,陈凡丁,程凤全,曹根宝,陈国防,曹桂芬,陈桂芳,陈国宏,楚桂华,陈广华,程桂华,陈国兰,陈国强,常桂英,崔贵章,常宏达,陈宏国,陈后金,蔡红建,陈惠娟,常惠玲,陈海泉,陈涵西,池海燕,曹洪章,陈建春,陈江华,陈建华,陈俊禄,陈嘉陵,陈劲松,蔡进山,陈健文,曹京伟,陈军霞,陈俊永,陈景艳,崔建英,崔江余,陈克华,陈克敏,陈洛加,陈立疆,陈连坤,程礼洛,陈力铭,陈立朋,常来秋,程莉莎,陈连锁,蔡林松,程力真,曹茂达,丛明路,陈茂利,陈梅倩,苍美艳,陈乃云,陈佩虹,陈普丽,陈庆华,陈其江,陈其林,陈庆良,崔秋云,程瑞华,蔡瑞桔,常汝英,蔡绍春,陈胜娟,陈淑玲,陈淑兰,曹素梅,陈士谦,池淑清,陈世荣,陈树文,陈树颖,蔡天芳,陈同占,陈维纯,陈文化,陈武岭,曹文平,陈星飚,陈秀春,陈旭东,陈学东,陈晓惠,陈喜明,陈秀平,程秀荣,陈锡生,池宪武,陈小芯,陈湘源,曹孝忠,崔永彪,崔迎春,陈永发,陈玉阁,陈蕴光,程荫杭,陈拥军,陈英俊,程玉兰,崔雅楼,崔永梅,崔衍清,陈玉泉,陈雅清,曹义仁,程育仁,程有生,陈玉婷,陈彦文,陈英微,常彦勋,陈岳源,曹英知,程振帮,曹振春,迟仲达,陈志方,陈志杰,陈宗礼,崔振录,程志明,陈中伟,成正维,蔡志阳,陈治中,刁波,段东,段虹,董虹,董慧,段辉,丁洪,丁健,董俊,杜林,董梁,杜明,丁娜,杜萍,董萍,都平,刁荣,戴霞,董佑,佟毅,丁燕,段义,董哲,丁宝生,董宝田,戴春爱,窦春娟,段春荣,戴春荣,丁殿玉,丁大志,董凤霞,董国富,刁焕娣,刁华梅,丁慧平,董河屏,邓红英,董金凤,丁金凤,董京华,段俊萍,段计山,窦君田,戴江雯,董敬祝,丁静之,丁嘉种,杜克明,狄克勤,丁莉芬,刁丽芳,董利剑,董丽敏,段连平,戴丽萍,董乐贤,董曼丽,戴明森,杜普选,丁鹏玉,杜庆花,董群毅,董其震,段曙光,戴胜华,杜树槐,段素梅,邓少亭,丁淑霞,杜庭梅,丁铁英,邸旺亮,邓新华,窦学军,丁晓明,邓小琴,董学仁,杜秀霞,丁锡云,杜锡钰,杜云慧,翟媛丽,董月明,杜永平,邓要武,邓振波,董志刚,邓正佳,杜紫梅,刁志萍,董志升,丁正庭,鄂明成,冯东,范辉,付昆,范玲,付俐,付明,傅榕,冯雪,范瑜,范颖,范征,费爱荣,冯宝玺,樊崇艺,冯凤娟,冯国臣,付国亮,房国彦,傅华坤,方浩林,房海蓉,冯海颖,付俊凤,范俊杰,樊京津,傅家林,樊静伲,冯继欣,樊建元,付奎亮,樊兰非,冯丽荣,冯林祥,冯民昌,冯其波,范秋江,傅秋良,付少红,方素梅,付天英,范铁燕,方卫宁,付晓东,付晓莉,付秀兰,冯锡生,费小益,方跃法,樊毓莲,方有亮,冯玉珉,范跃琼,冯衍全,冯玉乔,冯彦庆,冯玉荣,冯玉田,冯志春,方志刚,费志强,冯兆生,方醉湘,范植中,郭芳,国红,郭虹,巩慧,高晖,顾捷,郭洁,郭将,郭佳,高杰,高亮,顾磊,甘磊,高民,高琦,高日,高文,关伟,郭薇,葛苇,高岩,关宇,高芸,宫宇,高艳,高莹,高悦,高燕,郭嶷,龚展,葛爱华,谷爱军,高爱军,高爱庆,郭爱香,龚伯锋,高伯华,格保林,葛宝明,管宝琴,郭变英,郭北苑,郭春芳,郜春海,高翠香,葛东方,高德刚,顾冬梅,葛东雪,高德英,葛殿元,关锋华,高凤玲,高福廷,甘国和,高国和,高桂莲,高国平,高国英,高桂芝,关惠峰,高海林,郭海涛,高宏伟,郭鸿禧,郭海云,高洪宇,郭宏英,高红岩,郭继斌,谷季春,郭九峰,谷钧宏,高建华,高金海,郭京辉,郭婧娟,国建军,苟娟琼,郭金水,高金山,郭俊三,郭家松,郭建新,高静扬,关积珍,耿建增,管克英,郭黎辉,郭丽华,郭莉莉,高兰敏,郭兰生,龚敏明,关睦南,龚漫奇,郭美勤,葛迺康,葛全顺,葛秋生,高沁翔,高全增,耿如才,郭瑞凯,郭润珠,戈树栋,郭树东,郭淑芬,龚守江,顾素勤,高树榕,耿素仙,盖淑逸,高淑勇,顾淑珍,郭田德,桂文豪,郭维鸿,郭伟节,高文龙,郭卫平,顾文巧,郭雯霞,耿文学,高万英,桂向东,甘旭军,郭雪萌,高学民,宫小全,高小田,盖学武,顾翔宇,高晓莹,郭小玉,高彦彬,郭宇春,高玉臣,龚岩栋,高永峰,高玉华,郭燕君,高娅丽,高亚利,谷远利,关雅莉,郭玉明,高永茂,郭艳秋,龚玉荣,关砚如,高艳荣,高雅亭,郭易伟,关英馨,高艳侠,郭艳影,桂在斌,耿增德,关忠良,郭振岭,郭占起,龚卓蓉,淦作戎,高志文,葛正义,高振宇,高自友,耿增忠,韩冰,侯冰,韩放,胡刚,黄红,黄辉,何红,黄宏,胡俊,胡健,何军,海健,胡俭,霍凯,黄坤,韩雷,黄磊,黄岚,韩乐,何凌,何琳,胡琳,侯立,韩磊,韩梅,黄梅,胡明,黄平,何平,何青,黄清,胡蓉,韩松,黄胜,何涛,何腾,华伟,何玮,贺为,何为,洪伟,韩笑,郝鑫,黄欣,胡颖,黄颖,宏宇,黄彧,黄怡,黄宇,韩燕,韩臻,胡安洲,胡宝娟,侯炳麟,韩宝明,何伯述,华长春,胡传栋,霍翠凤,胡春玲,何春明,郝春荣,韩殿福,贺代平,何大伟,韩凤歧,郝广峰,胡国海,黄国辉,黄革樑,韩国荣,侯惠昌,黄皓芳,黄蕙恒,黄厚宽,黄洪亮,韩虹琳,贺海燕,洪剑斌,黄京芳,黄金海,韩经海,何继红,何金惠,韩继华,和敬涵,侯建军,何建军,侯君吉,侯积良,何金良,韩建民,洪建平,胡吉平,侯继涛,胡杰武,黄建伟,郝建英,胡锦云,韩丽峰,黄丽琳,黄琳琳,侯立民,赫莲琦,黄力群,韩兰茹,韩满怀,黄茂华,黄曼琳,黄美琦,何庆复,韩庆国,黄勤河,侯稔秋,郝荣泰,郝荣霞,韩如意,郝淑芬,胡绍海,贺少辉,黄世华,胡思继,何绍俭,胡树梅,惠淑琴,胡师舜,何世伟,郝生跃,胡书英,胡双增,胡天军,韩同样,黄卫东,胡万军,黄维科,何卫力,黄为群,侯香春,胡小刚,黄晓慧,贺旭红,何秀君,黄绣坤,韩学雷,郝晓莉,黄晓鸣,回晓文,黄学跃,黄绚晔,侯延冰,黄艳春,郝玉藏,何玉芳,郝永华,霍宇红,黄翌虹,韩延慧,黄业姣,胡永军,胡玉林,郝艳玲,黄友能,黄雅平,胡燕士,郝宇欣,侯亚欣,何映雪,何元元,何玉珍,何忠诚,胡正东,郝振芳,韩志航,何忠厚,黄最明,韩昭庆,郝志如,霍志锁,侯忠生,黄赞武,胡志先,贺仲雄,黄子扬,金刚,姜虹,江红,金玲,姜莉,金明,巨平,金松,姜申,蒋彤,蒋涛,荆涛,姜涛,简伟,姜惟,金文,金霞,蒋熙,姜昕,江喻,贾宝群,冀成会,贾长忠,蒋大明,焦风川,纪福宏,纪丰民,贾广会,蒋广军,姜广玲,贾公平,冀国蕊,靳惠芳,贾慧娟,靳红曼,纪惠文,金宏文,贾红娓,蒋焕文,贾怀义,贾洪雅,姜久春,贾俊芳,纪嘉伦,姜剑萍,姜景山,贾京元,金克俭,姜兰潮,贾利军,姜连军,姜丽君,蒋荔荔,金黎明,蒋明青,贾萍稳,贾汝慧,金如珍,鞠颂东,贾仕伶,蒋守宁,贾顺平,简水生,姬生月,金树泽,靳铁柱,景文宝,季文铎,姜文红,贾卫琴,姜文生,江伟世,季文玉,姬晓彬,姜学东,季晓衡,金晓军,金新民,蒋学清,姜秀山,贾秀曙,蒋晓雯,蒋哓旭,靳小燕,江晓阳,贾玉成,江源东,金玉芳,贾元华,金以娟,靳永宽,纪艳玲,蒋永莉,蒋玉明,姜忆南,焦彧童,姜玉珍,籍义忠,江中澳,贾朝勃,江中豪,姜志康,贾振玲,贾祖强,纪振清,贾卓生,蒋忠涌,孔飞,孔华,康俊,孔琳,邝明,康臻,康爱健,孔二全,孔繁荣,孔繁征,柯丰智,康敬东,康建宏,亢丽英,康寿万,阚叔愚,孔宪民,柯晓晴,柯新生,孔永健,康跃兰,寇永砺,可宗莉,李波,刘波,郎兵,李斌,刘琛,李冬,刘东,刘娣,刘恩,刘方,刘峰,林芳,李丰,刘华,李红,刘会,梁晖,刘虹,刘辉,刘海,刘航,李菊,刘军,梁景,刘菁,刘杰,林江,李进,栾军,郎军,吕杰,廉菁,罗俊,李军,林葵,刘凯,雷立,雷黎,骆丽,吕兰,李蕾,刘林,李莉,刘磊,刘岚,李良,黎明,陆玫,李年,刘宁,李平,蓝普,李萍,骆平,刘鹏,吕勤,隆青,黎群,李琦,刘勤,李秋,娄群,梁琦,李强,罗奇,刘强,林青,李蓉,刘锐,刘蓉,李爽,李凇,刘姗,李森,李彤,刘拓,罗涛,刘伟,李卫,李伟,李稳,李文,刘晓,陆霞,李洵,李曦,刘霞,刘鑫,刘云,刘英,刘越,梁毅,李洋,李英,李燕,李勇,刘燕,路勇,刘扬,梁英,乐远,李悦,刘嬿,刘莹,李岩,鲁钰,李翊,李焱,李莹,罗毅,刘义,李佐,兰哲,李忠,李智,刘喆,李振,李震,刘峥,刘泽,刘爱红,李爱中,刘宝呈,刘保东,刘宝刚,卢保军,刘宝娟,李白昆,刘宝兰,林柏梁,林碧琴,刘宝奇,李宝泉,罗秉锐,刘宝生,刘伯星,刘宝忠,李长春,吕长发,刘长福,李长虹,刘春华,刘长河,刘长江,刘翠君,梁春军,刘春兰,刘春丽,李春梅,刘春梅,李长平,刘春鹏,黎传琦,李常青,李承恕,刘策时,刘春生,刘崇伟,李成鲜,李纯喜,李晨霞,刘春霞,李超英,梁长缨,李德才,刘道冬,林玳玳,刘达德,刘德红,李德海,梁东海,李德娟,刘东岭,刘大群,刘德清,李冬青,林德全,刘殿仁,李德升,梁东升,刘大山,廖东升,李德旺,刘定燕,李大有,刘道义,兰恩光,刘绯绯,吕凤杰,李福俊,郎丰君,刘凤琴,李凤山,刘凤英,芦富彦,李法阳,刘凤珍,李福志,李国朝,刘国丛,李根成,刘国芳,刘桂芬,李国国,卢国华,李贵华,刘国衡,刘国华,李光磊,厉国权,李更青,李根起,李光荣,李光松,李更新,李国岫,刘更新,骆更新,李桂云,刘国忠,芦广中,刘宏波,李宏彪,李海滨,刘海斌,刘海东,刘宏纲,李海红,李红辉,李洪华,刘慧娟,李寒娟,刘红军,兰洪杰,罗鸿逵,李宏林,梁换亮,刘鹤玲,李红梅,刘慧敏,李宏年,李海宁,李和平,刘会齐,连会仁,刘慧茹,李华伟,李会霞,刘红星,刘火燕,刘洪彦,路红英,李海鹰,刘宏宇,李锦川,吕建成,陆建初,林建成,李景春,刘京斗,刘建国,李建国,刘建华女,刘建华男,刘金宏,罗江浩,李继红,吕江虹,李俊花,李剑君,李江靖,李继娟,刘京晶,李津京,李晋京,刘进军,李俊杰,刘建坤,刘金兰,陆金龄,卢继明,李金平,柳金甫,李京平,刘军甫,罗建平,罗京群,刘吉强,雷俊卿,李建强,刘金荣,路加栓,刘建生,李济生,刘建山,李京涛,刘江涛,李京文,刘京祥,刘静兮,李景新,李建勇,刘嘉言,李均英,刘景宇,李军子,李进芝,李开成,李克峰,刘坤会,罗凯军,刘克勤,李克文,刘连凤,罗来珩,刘岚岚,刘黎明,李利平,刘灵琴,刘丽荣,刘路薇,李历新,刘丽侠,刘莲云,李洛脏,刘连仲,陆玲珠,梁满贵,刘明光,李明辉,李敏惠,刘明惠,刘茂辉,刘慕华,李铭江,李勉丽,刘懋梁,卢茂楠,梁美琪,李岷珊,郎茂祥,刘铭心,李密秀,刘明星,李孟欣,卢明玉,李明仪,李明芝,刘平川,陆鹏飞,李平康,李培良,李培煊,李培源,吕培元,刘平竹,李千波,劳群芳,梁青槐,刘巧红,李清立,雷全立,李秋莎,冷强田,李秋田,刘庆新,李巧云,梁汝成,刘如九,刘仍奎,路日亮,刘润平,刘任平,刘荣祥,罗瑞英,廖仁忠,李绍斌,廖生波,刘书斌,刘绍波,李诗博,刘似臣,李守成,廖世恩,刘素范,刘世峰,刘松发,雷苏菲,李少华,留森华,李绍华,李淑红,卢寿洪,李树华,李淑华,李淑菊,林率力,梁似兰,李士兰,李森林,刘素丽,李士明,芦素梅,罗善美,李栓牛,刘士奇,李士群,娄淑琴,刘素琴,刘世荣,李士松,连韶彤,罗四维,刘绍武,刘淑香,李淑霞,刘淑贤,李舒心,李思泽,李同彬,李铁成,刘铁栋,李唐军,卢太金,李铁玲,李铁强,刘天善,林铁生,陆天翔,刘天驭,李文博,李文才,刘万成,李卫东,路伟东,刘卫丰,鲁卫国,刘文刚,刘文华,李卫红,李卫京,卢文良,李维敏,刘维宁,刘文铨,李伟生,刘万生,刘万寿,李文兴,刘文英,李文扬,刘伟艳,陆伟忠,李文洲,刘维智,李杏春,鲁晓春,陆晓春,李西达,林小芬,卢显峰,李晓光,刘星刚,李笑红,李秀花,刘小海,刘新华,卢先和,刘晓晖,刘秀惠,李晓剑,罗小俐,李晓玲,娄晓玲,李歆丽,刘需立,刘晓莉,李雪梅,刘秀梅,芦小敏,陆晓明,廖贤明,刘晓明,罗晓敏,刘小平,刘秀萍,刘夏萍,李向前,刘湘黔,李秀芹,刘晓锐,路秀青,路新生,李学伟,吕祥文,刘晓薇,蓝晓霞,吕晓寅,李栩薏,李兴宇,吕秀英,刘小燕,梁小燕,吕希艳,林晓言,刘新英,刘秀芝,李秀芝,李学政,刘贤珠,吕永波,李云白,刘迎春,李亚春,刘迎东,卢燕飞,刘永复,卢跃华,李玉和,李燕华,刘玉红,李银花,李远慧,梁亚红,吕宇航,刘艳君,李玉菊,柳拥军,刘雅君,李拥军,罗义军,刘玉琳,李彦来,李一玫,刘玉明,李义明,刘玉民,李艳梅,李砚平,刘玉萍,刘彦佩,刘延平,李银萍,陆一平,刘艳秋,刘彦青,廖涌泉,林玉琴,李燕青,吕雅群,李玉琴,李伊松,刘伊生,刘元盛,李义山,刘永泰,李艳涛,刘英武,李英伟,李永学,李亿祥,李永祥,乐逸祥,卢艳霞,栾云先,林玉霞,凌永玉,刘月云,刘银柱,刘依真,路玉芝,刘永正,李玉珍,柳尹哲,李志斌,李泽彬,林子斌,陆祖椿,刘志刚,李智光,刘志华,李忠海,李兆华,栾志红,李志杰,刘宗杰,林自葵,李振岭,刘子玲,刘兆林,刘志明,刘智敏,李志民,李兆平,罗志青,刘志强,刘之汀,刘志伟,李忠喜,刘作义,李哲英,刘中元,李泽有,李振玉,李智英,林卓英,刘正忠,莫丹,糜耽,马浩,毛军,孟建,马杰,马骏,马琳,马玲,马梅,缪萍,马强,门瑢,马驯,马旭,马运,穆岩,孟燕,马英,马跃,马颖,苗宇,马忠,毛保华,马宝华,明宝岩,孟春梅,马德仓,马迪芳,孟凡波,苗凤志,马广岩,马桂贞,穆海冰,莫宏建,苗鸿玲,毛海岭,马海林,毛慧玲,满洪深,马宏生,毛海涛,马惠英,穆建成,马建军,马俊连,马俊清,孟金全,苗建瑞,马继业,缪克英,满开言,马连川,马丽娜,门立群,缪龙秀,毛立英,孟玲叶,马立忠,马敏书,马美烟,牟乃蓉,马其昌,苗庆华,孟庆鹏,孟庆依,马瑞芳,马荣民,母树合,闵珊华,孟淑兰,牟顺波,孟嗣仪,孟铁军,马卫东,马维琴,马维秀,马晓春,买学军,孟宪礼,马雪亮,孟宪梅,马晓贤,马信侠,蒙小英,马云丛,马宇诚,马雨芬,马永红,毛永海,马彦娇,梅贻凯,马玉玲,马玉芹,马英新,莫永谊,马有昭,毛宗林,孟志勇,宁滨,聂磊,牛强,宁涛,牛原,宁智,倪代恒,那德顺,倪己昌,牛建军,聂君祥,倪克敏,倪民杰,倪平浩,南树娴,牛世洲,宁望和,南文华,钮文洁,佴晓东,聂雪兰,宁晓燕,南玉霞,欧国立,彭华,彭琳,彭磊,裴丽,潘力,彭湘,平洋,皮艳,彭劼,庞翠珠,彭代军,朋改非,潘红林,彭宏勤,彭俊彬,皮建国,裴劲松,彭名书,彭庆友,彭士刚,朴顺熙,彭文逵,彭雪海,潘行谦,蒲孝文,庞亚军,彭运年,潘玉萍,彭雅琴,潘玉香,彭燕子,庞作会,彭兆祺,屈波,邱成,秦芳,秦绩,邱军,秦璐,乔青,祁琴,钱瑞,祁英,秦碧明,钱超杰,钱超美,乔春生,钱春香,钱大琳,钱德贞,秦贵福,齐桂兰,渠刚荣,齐焕萍,钱菊琴,邱宽民,乔林基,屈连库,全练琴,齐立心,曲立忠,邱美容,漆明英,钱满义,秦秋凤,屈群英,乔清元,邱瑞昌,秦书华,秦四平,祁世萍,邱晓枫,钱兴华,齐晓娟,曲昭敏,齐向前,屈晓婷,瞿向阳,乔永宁,邱永忠,裘正定,权忠光,强朝晖,邱之静,秦作睿,齐赞伟,任斌,冉洁,任健,任希,任英,阮圆,任远,任宝龙,任赐成,荣朝和,任福民,荣桂军,任敬东,任建国,任建宏,任丽伟,荣启凤,荣启明,阮秋琦,任素芹,荣庭宝,任卫红,汝宜红,任尊松,盛昌,单冬,沙迪,沈飞,沙斐,苏红,孙贺,孙湖,孙健,苏净,孙晶,沈坚,孙静,宋皎,苏京,孙军,沈洁,孙杰,邵丽,单良,沙龙,苏璐,孙琳,孙敏,沈梅,尚明,隋娜,申萍,宋鹏,孙强,宋瑞,孙涛,沈伟,孙伟,孙昕,孙迅,宋雪,孙续,谌萱,施翔,施寅,孙越,石月,沈岩,孙轶,沈壁川,时伯发,宋伯慧,施贲宁,邵春福,孙春华,宋春景,宋春莉,史春荣,孙长索,孙东刚,宋大鹤,孙冬梅,孙德水,宋登轩,宋凤娟,宋光第,佘高红,束光辉,宋光明,时国勤,苏国庆,史广生,宋光森,税国双,孙冠雄,苏广英,孙海波,苏华成,孙慧环,孙贺捷,孙宏琳,史红梅,孙宏声,师红云,沈慧云,孙慧张,孙军昌,石峻晨,佘江东,宋泾舸,邵吉光,沈家洪,宋晶辉,孙锦华,孙建鸿,绳建军,宋金玲,沈家强,申金升,孙建忠,沈科迪,宋开番,宋开太,孙蓝烽,宋兰芳,绳丽惠,宋雷鸣,宋来民,邵丽萍,宋凌志,商朋见,苏培先,时庆国,宋庆会,孙全欣,尚青岩,邵钦瑜,孙日禾,宋瑞霞,孙士芬,孙守光,萨殊利,单淑兰,孙绍民,宋士宁,苏树强,宋三省,孙三山,宋守信,孙淑媛,单思跃,宋淑云,苏挺进,孙田庆,宋文兵,孙晚华,孙文辉,施婉丽,沈卫明,孙伟娜,孙伟青,苏文友,孙熙安,孙秀翠,隋小东,盛珣华,宋晓虹,孙孝家,施先亮,孙宪立,孙夕龙,孙晓萍,宋晓宇,孙秀英,孙贤颐,盛新志,施玉成,孙燕东,孙云娥,施一峰,孙艳丰,苏艳红,孙艳华,孙亚慧,孙以惠,石玉洁,孙英黎,邵玉明,沈永清,单彦秋,邵益勤,史月生,孙玉霜,司银涛,舒聿堂,史远伟,苏玉心,苏月香,宋永增,孙燕忠,孙宗富,石志飞,宋泽海,史贞军,宋志坤,史振磊,孙芝兰,宋之玲,孙志良,宋志敏,申振明,孙兆明,时芝平,史正群,宋兆全,沙振英,汤斌,陶成,滕枫,陶宏,唐宏,滕健,谭洁,陶晶,唐凯,唐梅,佟琼,唐涛,陶涛,唐莹,田颖,田源,唐宇,邰葆红,镡宝华,田宝伟,陶碧玉,屠春利,田果成,唐光辉,汤慧君,唐贺卿,陶和生,滕焕照,佟景才,滕京华,陶家昆,唐金生,谭克虎,涂开宁,佟立本,谭立刚,谭立华,田兰英,滕梦臣,谭南林,唐丕强,陶瑞华,陶若虹,田盛丰,田思源,谭文芳,田卫平,童晓峰,唐晓芳,汤小华,田新浩,田秀君,田晓明,田新荣,滕小瑛,童亦斌,田永丰,田玉江,田英杰,田艳敏,汤钰鹏,滕永平,唐永忠,谈振辉,田祝君,唐志明,唐祯敏,谭忠盛,唐中兴,陶宗跃,王冰,汪斌,王斌,王从,文超,王超,吴堤,王东,吴笛,王丹,汪凡,王峰,王锋,吴飞,王芳,王飞,汪锋";
    private String emailSuffixStr = "@gmail.com,@yahoo.com,@msn.com,@hotmail.com,@aol.com,@ask.com,@live.com,@qq.com,@0355.net,@163.com,@163.net,@263.net,@3721.net,@yeah.net,@yeah.net,@qq.com";

    private String nameStr = "王,王,王,王,王,王,王,王,王,王,王,王,王,王,王,王,王,王,王,王,王,王,李,李,李,李,李,李,李,李,李,李,李,李,李,李,李,李,李,李,张,刘,陈,杨,黄,吴,赵,周,徐,孙,马,朱,胡,林,郭,何,高,罗,郑,梁,谢,宋,唐,许,邓,冯,韩,曹,曾,彭,萧,蔡,潘,田,董,袁,于,余,叶,蒋,杜,苏,魏,程,吕,丁,沈,任,姚,卢,傅,钟,姜,崔,谭,廖,范,汪,陆,金,石,戴,贾,韦,夏,邱,方,侯,邹,熊,孟,秦,白,江,阎,薛,尹,段,雷,黎,史,龙,陶,贺,顾,毛,郝,龚,邵,万,钱,严,赖,覃,洪,武,莫,孔,汤,向,常,温,康,施,文,牛,樊,葛,邢,安,齐,易,乔,伍,庞,颜,倪,庄,聂,章,鲁,岳,翟,殷,詹,申,欧,耿,关,兰,焦,俞,左,柳,甘,祝,包,宁,尚,符,舒,阮,柯,纪,梅,童,凌,毕,单,季,裴,霍,涂,成,苗,谷,盛,曲,翁,冉,骆,蓝,路,游,辛,靳,欧阳,管,柴,蒙,鲍,华,喻,祁,蒲,房,滕,屈,饶,解,牟,艾,尤,阳,时,穆,农,司,卓,古,吉,缪,简,车,项,连,芦,麦,褚,娄,窦,戚,岑,景,党,宫,费,卜,冷,晏,席,卫,米,柏,宗,瞿,桂,全,佟,应,臧,闵,苟,邬,边,卞,姬,师,和,仇,栾,隋,商,刁,沙,荣,巫,寇,桑,郎,甄,丛,仲,虞,敖,巩,明,佘,池,查,麻,苑,迟,邝,官,封,谈,匡";

    private String[] nameArray;
    private Map<Integer,String> lastNameMap ;
    private String[] emailSuffixArray;

    /**
     * 初始化程序
     */
    public RandomFieldsUtil()  {
        nameArray = nameStr.split(",");
        lastNameMap = new HashMap<Integer, String>();

        for(int i = 0 ; i<nameArray.length;i++){
            lastNameMap.put(i,nameArray[i]);
        }

        emailSuffixArray = emailSuffixStr.split(",");
    }

    /**
     * 随机生成名字
     * @param len
     * @return
     */
    public String getFirstName(int len) {
        Random random = new Random();
        String ret = "";
        for (int i = 0; i < len; i++) {
            String str = null;
            int hightPos, lowPos; // 定义高低位

            hightPos = (176 + Math.abs(random.nextInt(39))); // 获取高位值
            lowPos = (161 + Math.abs(random.nextInt(93))); // 获取低位值
            byte[] b = new byte[2];
            b[0] = (new Integer(hightPos).byteValue());
            b[1] = (new Integer(lowPos).byteValue());
            try {
                str = new String(b, "GBK"); // 转成中文
            } catch (UnsupportedEncodingException ex) {
                ex.printStackTrace();
            }
            ret += str;
        }
        return ret;
    }

//    public Map<Integer,String> getLastName(){
//        Map<Integer,String> lastNames = new HashMap<Integer,String>();
//
////        String[] nameArray = nameStr.split(",");
//
//        for(int i = 0 ; i<nameArray.length;i++){
//            lastNames.put(i,nameArray[i]);
//        }
//
//        return lastNames;
//    }


    /**
     * 随机生成一个人名
     * @return
     */
    public String getRName() {
        try {
            int index = RandomUtils.nextInt(0, lastNameMap.size());
            String lastName = lastNameMap.get(index);
            String firstName = getFirstName(2);

            return lastName + firstName;
        } catch (Exception e) {
            e.printStackTrace();
        }

        return "";
    }

    /**
     * 生成登录名
     * @param name
     * @return
     */
    public String getUserName(String name) {
        return Pinyin4JUtil.getPinYin(name);
    }

    /**
     * 随机生成日期
     * @param start yyyy-MM-dd
     * @param end yyyy-MM-dd
     * @return
     */
    public Date getRDate(String start, String end) {
        try {
            SimpleDateFormat sdf = new SimpleDateFormat("yyyy-mm-dd");
            Date startDate = sdf.parse(start);
            Date endDate = sdf.parse(end);

            sdf.applyPattern("yyyy");
            Integer rYear = RandomUtils.nextInt(Integer.parseInt(sdf.format(startDate)),
                    Integer.parseInt(sdf.format(endDate)) + 1);
            sdf.applyPattern("MM");
            Integer rMonth = RandomUtils.nextInt(Integer.parseInt(sdf.format(startDate)),
                    Integer.parseInt(sdf.format(endDate)) + 1);
            sdf.applyPattern("dd");
            Integer rDay = RandomUtils.nextInt(Integer.parseInt(sdf.format(startDate)),
                    Integer.parseInt(sdf.format(endDate)) + 1);

            String yyyyMMdd = rYear + "-" + rMonth + "-" + rDay;
            sdf.applyPattern("yyyy-MM-dd");

            return sdf.parse(yyyyMMdd);

        } catch (ParseException e) {
            e.printStackTrace();
        }

        return new Date();
    }

    /**
     * 根据用户名随机生成邮箱
     * @return
     */
    public String getREmail(String name) {
        Integer index = RandomUtils.nextInt(0, emailSuffixArray.length);
        return getUserName(name) + emailSuffixArray[index];
    }

    public static void main(String[] args) {
        RandomFieldsUtil randomFieldsUtil = new RandomFieldsUtil();
        String rName = randomFieldsUtil.getRName();
        System.out.println(rName + " " + randomFieldsUtil.getUserName(rName) + "    " + randomFieldsUtil.getREmail(rName));

        String rName2 = randomFieldsUtil.getRName();
        System.out.println(rName2 + " " + randomFieldsUtil.getUserName(rName2) + "    " + randomFieldsUtil.getREmail(rName2));

//
//        for(int i = 0; i < 100; ++i) {
//            System.out.println(DateUtil.dateToString(randomFieldsUtil.getRDate("1980-01-01", "1995-12-31"), "yyyy-MM-dd"));
//        }
//
//        for(int i = 0; i < 100; ++i) {
//            System.out.println(randomFieldsUtil.getREmail(rName));
//        }



//        System.out.println(randomFieldsUtil.getRName());



    }
}
